GUdaoxi/demo_qspi/QSPI_QPI/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_spi.h
#define SPI_CR2_SSN_Pos (2U)
#define SPI_CR2_SSN_Msk (0x1U << SPI_CR2_SSN_Pos)
#define SPI_CR2_SSN SPI_CR2_SSN_Msk

#define SPI_CR2_SSNSEN_Pos (1U)
#define SPI_CR2_SSNSEN_Msk (0x1U << SPI_CR2_SSNSEN_Pos)
#define SPI_CR2_SSNSEN SPI_CR2_SSNSEN_Msk

#define SPI_CR2_SPIEN_Pos (0U)
#define SPI_CR2_SPIEN_Msk (0x1U << SPI_CR2_SPIEN_Pos)
#define SPI_CR2_SPIEN SPI_CR2_SPIEN_Msk

#define SPI_CR3_TXBFC_Pos (3U)
#define SPI_CR3_TXBFC_Msk (0x1U << SPI_CR3_TXBFC_Pos)
#define SPI_CR3_TXBFC SPI_CR3_TXBFC_Msk

#define SPI_CR3_RXBFC_Pos (2U)
#define SPI_CR3_RXBFC_Msk (0x1U << SPI_CR3_RXBFC_Pos)
#define SPI_CR3_RXBFC SPI_CR3_RXBFC_Msk

#define SPI_CR3_MERRC_Pos (1U)
#define SPI_CR3_MERRC_Msk (0x1U << SPI_CR3_MERRC_Pos)
#define SPI_CR3_MERRC SPI_CR3_MERRC_Msk

#define SPI_CR3_SERRC_Pos (0U)
#define SPI_CR3_SERRC_Msk (0x1U << SPI_CR3_SERRC_Pos)
#define SPI_CR3_SERRC SPI_CR3_SERRC_Msk

#define SPI_IER_SSNRIE_Pos (5U)
#define SPI_IER_SSNRIE_Msk (0x1U << SPI_IER_SSNRIE_Pos)
#define SPI_IER_SSNRIE SPI_IER_SSNRIE_Msk

#define SPI_IER_SSNFIE_Pos (4U)
#define SPI_IER_SSNFIE_Msk (0x1U << SPI_IER_SSNFIE_Pos)
#define SPI_IER_SSNFIE SPI_IER_SSNFIE_Msk

#define SPI_IER_TXSEIE_Pos (3U)
#define SPI_IER_TXSEIE_Msk (0x1U << SPI_IER_TXSEIE_Pos)
#define SPI_IER_TXSEIE SPI_IER_TXSEIE_Msk

#define SPI_IER_ERRIE_Pos (2U)
#define SPI_IER_ERRIE_Msk (0x1U << SPI_IER_ERRIE_Pos)
#define SPI_IER_ERRIE SPI_IER_ERRIE_Msk

#define SPI_IER_TXBEIE_Pos (1U)
#define SPI_IER_TXBEIE_Msk (0x1U << SPI_IER_TXBEIE_Pos)
#define SPI_IER_TXBEIE SPI_IER_TXBEIE_Msk

#define SPI_IER_RXIE_Pos (0U)
#define SPI_IER_RXIE_Msk (0x1U << SPI_IER_RXIE_Pos)
#define SPI_IER_RXIE SPI_IER_RXIE_Msk

#define SPI_ISR_DCN_TX_Pos (12U)
#define SPI_ISR_DCN_TX_Msk (0x1U << SPI_ISR_DCN_TX_Pos)
#define SPI_ISR_DCN_TX SPI_ISR_DCN_TX_Msk

#define SPI_ISR_RXCOL_Pos (10U)
#define SPI_ISR_RXCOL_Msk (0x1U << SPI_ISR_RXCOL_Pos)
#define SPI_ISR_RXCOL SPI_ISR_RXCOL_Msk

#define SPI_ISR_TXCOL_Pos (9U)
#define SPI_ISR_TXCOL_Msk (0x1U << SPI_ISR_TXCOL_Pos)
#define SPI_ISR_TXCOL SPI_ISR_TXCOL_Msk

#define SPI_ISR_BUSY_Pos (8U)
#define SPI_ISR_BUSY_Msk (0x1U << SPI_ISR_BUSY_Pos)
#define SPI_ISR_BUSY SPI_ISR_BUSY_Msk

#define SPI_ISR_CHSIDE_Pos (7U)
#define SPI_ISR_CHSIDE_Msk (0x1U << SPI_ISR_CHSIDE_Pos)
#define SPI_ISR_CHSIDE SPI_ISR_CHSIDE_Msk

#define SPI_ISR_MERR_Pos (6U)
#define SPI_ISR_MERR_Msk (0x1U << SPI_ISR_MERR_Pos)
#define SPI_ISR_MERR SPI_ISR_MERR_Msk

#define SPI_ISR_SERR_Pos (5U)
#define SPI_ISR_SERR_Msk (0x1U << SPI_ISR_SERR_Pos)
#define SPI_ISR_SERR SPI_ISR_SERR_Msk

#define SPI_ISR_SSNR_Pos (4U)
#define SPI_ISR_SSNR_Msk (0x1U << SPI_ISR_SSNR_Pos)
#define SPI_ISR_SSNR SPI_ISR_SSNR_Msk

#define SPI_ISR_SSNF_Pos (3U)
#define SPI_ISR_SSNF_Msk (0x1U << SPI_ISR_SSNF_Pos)
#define SPI_ISR_SSNF SPI_ISR_SSNF_Msk

#define SPI_ISR_TXSE_Pos (2U)
#define SPI_ISR_TXSE_Msk (0x1U << SPI_ISR_TXSE_Pos)
#define SPI_ISR_TXSE SPI_ISR_TXSE_Msk

#define SPI_ISR_TXBE_Pos (1U)
#define SPI_ISR_TXBE_Msk (0x1U << SPI_ISR_TXBE_Pos)
#define SPI_ISR_TXBE SPI_ISR_TXBE_Msk

#define SPI_ISR_RXBF_Pos (0U)
#define SPI_ISR_RXBF_Msk (0x1U << SPI_ISR_RXBF_Pos)
#define SPI_ISR_RXBF SPI_ISR_RXBF_Msk

#define FL_SPI_MASTER_SAMPLING_NORMAL (0x0U << SPI_CR1_MSPA_Pos)
#define FL_SPI_MASTER_SAMPLING_DELAY_HALFCLK (0x1U << SPI_CR1_MSPA_Pos)

#define FL_SPI_SLAVE_SAMPLING_NORMAL (0x0U << SPI_CR1_SSPA_Pos)
#define FL_SPI_SLAVE_SAMPLING_ADVANCE_HALFCLK (0x1U << SPI_CR1_SSPA_Pos)

#define FL_SPI_WORK_MODE_SLAVE (0x0U << SPI_CR1_MM_Pos)
#define FL_SPI_WORK_MODE_MASTER (0x1U << SPI_CR1_MM_Pos)

#define FL_SPI_SEND_WAIT_0 (0x0U << SPI_CR1_WAIT_Pos)
#define FL_SPI_SEND_WAIT_1 (0x1U << SPI_CR1_WAIT_Pos)
#define FL_SPI_SEND_WAIT_2 (0x2U << SPI_CR1_WAIT_Pos)
#define FL_SPI_SEND_WAIT_3 (0x3U << SPI_CR1_WAIT_Pos)

#define FL_SPI_CLK_DIV2 (0x0U << SPI_CR1_BAUD_Pos)
#define FL_SPI_CLK_DIV4 (0x1U << SPI_CR1_BAUD_Pos)
#define FL_SPI_CLK_DIV8 (0x2U << SPI_CR1_BAUD_Pos)
#define FL_SPI_CLK_DIV16 (0x3U << SPI_CR1_BAUD_Pos)
#define FL_SPI_CLK_DIV32 (0x4U << SPI_CR1_BAUD_Pos)
#define FL_SPI_CLK_DIV64 (0x5U << SPI_CR1_BAUD_Pos)
#define FL_SPI_CLK_DIV128 (0x6U << SPI_CR1_BAUD_Pos)
#define FL_SPI_CLK_DIV256 (0x7U << SPI_CR1_BAUD_Pos)

#define FL_SPI_BAUDRATE_DIV2 (0x0U << SPI_CR1_BAUD_Pos)
#define FL_SPI_BAUDRATE_DIV4 (0x1U << SPI_CR1_BAUD_Pos)
#define FL_SPI_BAUDRATE_DIV8 (0x2U << SPI_CR1_BAUD_Pos)
#define FL_SPI_BAUDRATE_DIV16 (0x3U << SPI_CR1_BAUD_Pos)
#define FL_SPI_BAUDRATE_DIV32 (0x4U << SPI_CR1_BAUD_Pos)
#define FL_SPI_BAUDRATE_DIV64 (0x5U << SPI_CR1_BAUD_Pos)
#define FL_SPI_BAUDRATE_DIV128 (0x6U << SPI_CR1_BAUD_Pos)
#define FL_SPI_BAUDRATE_DIV256 (0x7U << SPI_CR1_BAUD_Pos)

#define FL_SPI_BIT_ORDER_MSB_FIRST (0x0U << SPI_CR1_LSBF_Pos)
#define FL_SPI_BIT_ORDER_LSB_FIRST (0x1U << SPI_CR1_LSBF_Pos)

#define FL_SPI_POLARITY_NORMAL (0x0U << SPI_CR1_CPOL_Pos)
#define FL_SPI_POLARITY_INVERT (0x1U << SPI_CR1_CPOL_Pos)

#define FL_SPI_PHASE_EDGE1 (0x0U << SPI_CR1_CPHA_Pos)
#define FL_SPI_PHASE_EDGE2 (0x1U << SPI_CR1_CPHA_Pos)

#define FL_SPI_DATAH_WIDTH0 (0x0U << SPI_CR2_DLEN2_Pos)
#define FL_SPI_DATAH_WIDTH1 (0x1U << SPI_CR2_DLEN2_Pos)
#define FL_SPI_DATAH_WIDTH2 (0x2U << SPI_CR2_DLEN2_Pos)
#define FL_SPI_DATAH_WIDTH3 (0x3U << SPI_CR2_DLEN2_Pos)
#define FL_SPI_DATAH_WIDTH4 (0x4U << SPI_CR2_DLEN2_Pos)
#define FL_SPI_DATAH_WIDTH5 (0x5U << SPI_CR2_DLEN2_Pos)
#define FL_SPI_DATAH_WIDTH6 (0x6U << SPI_CR2_DLEN2_Pos)
#define FL_SPI_DATAH_WIDTH7 (0x7U << SPI_CR2_DLEN2_Pos)

#define FL_SPI_DATAL_WIDTH0 (0x0U << SPI_CR2_DLEN_Pos)
#define FL_SPI_DATAL_WIDTH1 (0x1U << SPI_CR2_DLEN_Pos)
#define FL_SPI_DATAL_WIDTH2 (0x2U << SPI_CR2_DLEN_Pos)
#define FL_SPI_DATAL_WIDTH3 (0x3U << SPI_CR2_DLEN_Pos)

#define FL_SPI_TRANSFER_MODE_FULL_DUPLEX (0x0U << SPI_CR2_HALFDUPLEX_Pos)
#define FL_SPI_TRANSFER_MODE_HALF_DUPLEX (0x1U << SPI_CR2_HALFDUPLEX_Pos)

#define FL_SPI_HALF_DUPLEX_TX (0x0U << SPI_CR2_HD_RW_Pos)
#define FL_SPI_HALF_DUPLEX_RX (0x1U << SPI_CR2_HD_RW_Pos)

#define FL_SPI_HALF_DUPLEX_CMDLEN_DLEN (0x0U << SPI_CR2_CMD8B_Pos)
#define FL_SPI_HALF_DUPLEX_CMDLEN_8B (0x1U << SPI_CR2_CMD8B_Pos)

#define FL_SPI_HALFDUPLEX_CMDLEN_DLEN (0x0U << SPI_CR2_CMD8B_Pos)
#define FL_SPI_HALFDUPLEX_CMDLEN_8B (0x1U << SPI_CR2_CMD8B_Pos)

#define FL_SPI_HARDWARE_SSN_KEEP_LOW (0x0U << SPI_CR2_SSNM_Pos)
#define FL_SPI_HARDWARE_SSN_AUTO_HIGH (0x1U << SPI_CR2_SSNM_Pos)

#define FL_SPI_SSN_LOW (0x0U << SPI_CR2_SSN_Pos)
#define FL_SPI_SSN_HIGH (0x1U << SPI_CR2_SSN_Pos)

#define FL_SPI_FRAME_MODE_CMD (0x0U << SPI_ISR_DCN_TX_Pos)
#define FL_SPI_FRAME_MODE_DATA (0x1U << SPI_ISR_DCN_TX_Pos)

#define FL_SPI_VOCAL_TRACT_LEFT (0x0U << SPI_ISR_CHSIDE_Pos)
#define FL_SPI_VOCAL_TRACT_RIGHT (0x1U << SPI_ISR_CHSIDE_Pos)

#define I2S_IER_SSNRFIE_Pos (5U)
#define I2S_IER_SSNRIE_Msk (0x1U << I2S_IER_SSNRFIE_Pos)
#define I2S_IER_SSNRFIE I2S_IER_SSNRIE_Msk

#define I2S_IER_SSNFIE_Pos (4U)
#define I2S_IER_SSNFIE_Msk (0x1U << I2S_IER_SSNFIE_Pos)
#define I2S_IER_SSNFIE I2S_IER_SSNFIE_Msk

#define I2S_IER_TXSEIE_Pos (3U)
#define I2S_IER_TXSEIE_Msk (0x1U << I2S_IER_TXSEIE_Pos)
#define I2S_IER_TXSEIE I2S_IER_TXSEIE_Msk

#define I2S_IER_ERRIE_Pos (2U)
#define I2S_IER_ERRIE_Msk (0x1U << I2S_IER_ERRIE_Pos)
#define I2S_IER_ERRIE I2S_IER_ERRIE_Msk

#define I2S_IER_TXBEIE_Pos (1U)
#define I2S_IER_TXBEIE_Msk (0x1U << I2S_IER_TXBEIE_Pos)
#define I2S_IER_TXBEIE I2S_IER_TXBEIE_Msk

#define I2S_IER_RXIE_Pos (0U)
#define I2S_IER_RXIE_Msk (0x1U << I2S_IER_RXIE_Pos)
#define I2S_IER_RXIE I2S_IER_RXIE_Msk

#define I2S_ISR_DCN_TX_Pos (12U)
#define I2S_ISR_DCN_TX_Msk (0x1U << I2S_ISR_DCN_TX_Pos)
#define I2S_ISR_DCN_TX I2S_ISR_DCN_TX_Msk

#define I2S_ISR_RXCOL_Pos (10U)
#define I2S_ISR_RXCOL_Msk (0x1U << I2S_ISR_RXCOL_Pos)
#define I2S_ISR_RXCOL I2S_ISR_RXCOL_Msk

