GUdaoxi/demo_qspi/QSPI_QPI/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_spi.h
#define I2S_ISR_TXCOL_Pos (9U)
#define I2S_ISR_TXCOL_Msk (0x1U << I2S_ISR_TXCOL_Pos)
#define I2S_ISR_TXCOL I2S_ISR_TXCOL_Msk

#define I2S_ISR_BUSY_Pos (8U)
#define I2S_ISR_BUSY_Msk (0x1U << I2S_ISR_BUSY_Pos)
#define I2S_ISR_BUSY I2S_ISR_BUSY_Msk

#define I2S_ISR_CHSIDE_Pos (7U)
#define I2S_ISR_CHSIDE_Msk (0x1U << I2S_ISR_CHSIDE_Pos)
#define I2S_ISR_CHSIDE I2S_ISR_CHSIDE_Msk

#define I2S_ISR_MERR_Pos (6U)
#define I2S_ISR_MERR_Msk (0x1U << I2S_ISR_MERR_Pos)
#define I2S_ISR_MERR I2S_ISR_MERR_Msk

#define I2S_ISR_SERR_Pos (5U)
#define I2S_ISR_SERR_Msk (0x1U << I2S_ISR_SERR_Pos)
#define I2S_ISR_SERR I2S_ISR_SERR_Msk

#define I2S_ISR_SSNR_Pos (4U)
#define I2S_ISR_SSNR_Msk (0x1U << I2S_ISR_SSNR_Pos)
#define I2S_ISR_SSNR I2S_ISR_SSNR_Msk

#define I2S_ISR_SSNF_Pos (3U)
#define I2S_ISR_SSNF_Msk (0x1U << I2S_ISR_SSNF_Pos)
#define I2S_ISR_SSNF I2S_ISR_SSNF_Msk

#define I2S_ISR_TXSE_Pos (2U)
#define I2S_ISR_TXSE_Msk (0x1U << I2S_ISR_TXSE_Pos)
#define I2S_ISR_TXSE I2S_ISR_TXSE_Msk

#define I2S_ISR_TXBE_Pos (1U)
#define I2S_ISR_TXBE_Msk (0x1U << I2S_ISR_TXBE_Pos)
#define I2S_ISR_TXBE I2S_ISR_TXBE_Msk

#define I2S_ISR_RXBF_Pos (0U)
#define I2S_ISR_RXBF_Msk (0x1U << I2S_ISR_RXBF_Pos)
#define I2S_ISR_RXBF I2S_ISR_RXBF_Msk

#define I2S_TXBUF_Pos (0U)
#define I2S_TXBUF_Msk (0xffffffffU << I2S_TXBUF_Pos)
#define I2S_TXBUF I2S_TXBUF_Msk

#define I2S_RXBUF_Pos (0U)
#define I2S_RXBUF_Msk (0xffffffffU << I2S_RXBUF_Pos)
#define I2S_RXBUF I2S_RXBUF_Msk

#define I2SCR_RXOPT_Pos (12U)
#define I2SCR_RXOTP_Msk (0x1U << I2SCR_RXOPT_Pos)
#define I2SCR_RXOTP I2SCR_RXOTP_Msk

#define I2SCR_I2SSTD_Pos (10U)
#define I2SCR_I2SSTD_Msk (0x3U << I2SCR_I2SSTD_Pos)
#define I2SCR_I2SSTD I2SCR_I2SSTD_Msk

#define I2SCR_CHLEN_Pos (9U)
#define I2SCR_CHLEN_Msk (0x1U << I2SCR_CHLEN_Pos)
#define I2SCR_CHLEN I2SCR_CHLEN_Msk

#define I2SCR_CKPOL_Pos (8U)
#define I2SCR_CKPOL_Msk (0x1U << I2SCR_CKPOL_Pos)
#define I2SCR_CKPOL I2SCR_CKPOL_Msk

#define I2SCR_DLEN_Pos (6U)
#define I2SCR_DLEN_Msk (0x3U << I2SCR_DLEN_Pos)
#define I2SCR_DLEN I2SCR_DLEN_Msk

#define I2SCR_PCMSYNC_Pos (5U)
#define I2SCR_PCMSYNC_Msk (0x1U << I2SCR_PCMSYNC_Pos)
#define I2SCR_PCMSYNC I2SCR_PCMSYNC_Msk

#define I2SCR_I2SMM_Pos (3U)
#define I2SCR_I2SMM_Msk (0x3U << I2SCR_I2SMM_Pos)
#define I2SCR_I2SMM I2SCR_I2SMM_Msk

#define I2SCR_DLYEN_Pos (2U)
#define I2SCR_DLYEN_Msk (0x1U << I2SCR_DLYEN_Pos)
#define I2SCR_DLYEN I2SCR_DLYEN_Msk

#define I2SCR_I2SMOD_Pos (1U)
#define I2SCR_I2SMOD_Msk (0x1U << I2SCR_I2SMOD_Pos)
#define I2SCR_I2SMOD I2SCR_I2SMOD_Msk

#define I2SCR_I2SEN_Pos (0U)
#define I2SCR_I2SEN_Msk (0x1U << I2SCR_I2SEN_Pos)
#define I2SCR_I2SEN I2SCR_I2SEN_Msk

#define I2SPR_MCKOE_Pos (9U)
#define I2SPR_MCKOE_Msk (0x1U << I2SPR_MCKOE_Pos)
#define I2SPR_MCKOE I2SPR_MCKOE_Msk

#define I2SPR_ODD_Pos (8U)
#define I2SPR_ODD_Msk (0x1U << I2SPR_ODD_Pos)
#define I2SPR_ODD I2SPR_ODD_Msk

#define I2SPR_CLKDIV_Pos (0U)
#define I2SPR_CLKDIV_Msk (0xffU << I2SPR_CLKDIV_Pos)
#define I2SPR_CLKDIV I2SPR_CLKDIV_Msk

#define FL_I2S_FRAME_MODE_CMD (0x0U << I2S_ISR_DCN_TX_Pos)
#define FL_I2S_FRAME_MODE_DATA (0x1U << I2S_ISR_DCN_TX_Pos)

#define FL_I2S_VOCAL_TRACT_LEFT (0x0U << I2S_ISR_CHSIDE_Pos)
#define FL_I2S_VOCAL_TRACT_RIGHT (0x1U << I2S_ISR_CHSIDE_Pos)

#define FL_I2S_STANDARD_MODE_PHILIPS (0x0U << I2SCR_I2SSTD_Pos)
#define FL_I2S_STANDARD_MODE_MSB_JUSTIFIED (0x1U << I2SCR_I2SSTD_Pos)
#define FL_I2S_STANDARD_MODE_LSB_JUSTIFIED (0x2U << I2SCR_I2SSTD_Pos)
#define FL_I2S_STANDARD_MODE_PCM (0x3U << I2SCR_I2SSTD_Pos)

#define FL_I2S_VOCAL_TRACT_LENGTH_16BITS (0x0U << I2SCR_CHLEN_Pos)
#define FL_I2S_VOCAL_TRACT_LENGTH_32BITS (0x1U << I2SCR_CHLEN_Pos)

#define FL_I2S_IDLE_POLARITY_LOW (0x0U << I2SCR_CKPOL_Pos)
#define FL_I2S_IDLE_POLARITY_HIGHT (0x1U << I2SCR_CKPOL_Pos)

#define FL_I2S_DATA_LENGTH_16BITS (0x0U << I2SCR_DLEN_Pos)
#define FL_I2S_DATA_LENGTH_24BITS (0x1U << I2SCR_DLEN_Pos)
#define FL_I2S_DATA_LENGTH_32BITS (0x2U << I2SCR_DLEN_Pos)

#define FL_I2S_FRAME_SYNCHRONIZATION_SHORT (0x0U << I2SCR_PCMSYNC_Pos)
#define FL_I2S_FRAME_SYNCHRONIZATION_LONG (0x1U << I2SCR_PCMSYNC_Pos)

#define FL_I2S_MODE_SLAVE_RX (0x0U << I2SCR_I2SMM_Pos)
#define FL_I2S_MODE_SLAVE_TX (0x1U << I2SCR_I2SMM_Pos)
#define FL_I2S_MODE_MASTER_RX (0x2U << I2SCR_I2SMM_Pos)
#define FL_I2S_MODE_MASTER_TX (0x3U << I2SCR_I2SMM_Pos)

#define FL_I2S_PERIPHRAL_MODE_SPI (0x0U << I2SCR_I2SMOD_Pos)
#define FL_I2S_PERIPHRAL_MODE_I2S (0x1U << I2SCR_I2SMOD_Pos)

#define FL_I2S_PRESCALER_PARITY_EVEN (0x0U << I2SPR_ODD_Pos)
#define FL_I2S_PRESCALER_PARITY_ODD (0x1U << I2SPR_ODD_Pos)

  /**
   * @}
   */
  /* Exported functions ---------------------------------------------------------------------------------*/
  /** @defgroup SPI_FL_Exported_Functions SPI Exported Functions
   * @{
   */

  /**
   * @brief    Enable SPI IO Pin Swap
   * @rmtoll   CR1    IOSWAP    FL_SPI_EnablePinSwap
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_EnablePinSwap(SPI_Type *SPIx)
  {
    SET_BIT(SPIx->CR1, SPI_CR1_IOSWAP_Msk);
  }

  /**
   * @brief    Get SPI IO Pin Swap State
   * @rmtoll   CR1    IOSWAP    FL_SPI_IsEnabledPinSwap
   * @param    SPIx SPI instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_SPI_IsEnabledPinSwap(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->CR1, SPI_CR1_IOSWAP_Msk) == SPI_CR1_IOSWAP_Msk);
  }

  /**
   * @brief    Disable SPI IO Pin Swap
   * @rmtoll   CR1    IOSWAP    FL_SPI_DisablePinSwap
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_DisablePinSwap(SPI_Type *SPIx)
  {
    CLEAR_BIT(SPIx->CR1, SPI_CR1_IOSWAP_Msk);
  }

  /**
   * @brief    Set Master Sampling Position Adjustment
   * @rmtoll   CR1    MSPA    FL_SPI_SetMasterSamplingAdjust
   * @param    SPIx SPI instance
   * @param    adjust This parameter can be one of the following values:
   *           @arg @ref FL_SPI_MASTER_SAMPLING_NORMAL
   *           @arg @ref FL_SPI_MASTER_SAMPLING_DELAY_HALFCLK
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_SetMasterSamplingAdjust(SPI_Type *SPIx, uint32_t adjust)
  {
    MODIFY_REG(SPIx->CR1, SPI_CR1_MSPA_Msk, adjust);
  }

  /**
   * @brief    Get Master Sampling Position Adjustment
   * @rmtoll   CR1    MSPA    FL_SPI_GetMasterSamplingAdjust
   * @param    SPIx SPI instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_SPI_MASTER_SAMPLING_NORMAL
   *           @arg @ref FL_SPI_MASTER_SAMPLING_DELAY_HALFCLK
   */
  __STATIC_INLINE uint32_t FL_SPI_GetMasterSamplingAdjust(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->CR1, SPI_CR1_MSPA_Msk));
  }

  /**
   * @brief    Set Slave Sending Position Adjustment
   * @rmtoll   CR1    SSPA    FL_SPI_SetSlaveSamplingAdjust
   * @param    SPIx SPI instance
   * @param    adjust This parameter can be one of the following values:
   *           @arg @ref FL_SPI_SLAVE_SAMPLING_NORMAL
   *           @arg @ref FL_SPI_SLAVE_SAMPLING_ADVANCE_HALFCLK
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_SetSlaveSamplingAdjust(SPI_Type *SPIx, uint32_t adjust)
  {
    MODIFY_REG(SPIx->CR1, SPI_CR1_SSPA_Msk, adjust);
  }

  /**
   * @brief    Get Slave Sending Position Adjustment
   * @rmtoll   CR1    SSPA    FL_SPI_GetSlaveSamplingAdjust
   * @param    SPIx SPI instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_SPI_SLAVE_SAMPLING_NORMAL
   *           @arg @ref FL_SPI_SLAVE_SAMPLING_ADVANCE_HALFCLK
   */
  __STATIC_INLINE uint32_t FL_SPI_GetSlaveSamplingAdjust(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->CR1, SPI_CR1_SSPA_Msk));
  }

  /**
   * @brief    Set SPI Working Mode
   * @rmtoll   CR1    MM    FL_SPI_SetWorkMode
   * @param    SPIx SPI instance
   * @param    mode This parameter can be one of the following values:
   *           @arg @ref FL_SPI_WORK_MODE_SLAVE
   *           @arg @ref FL_SPI_WORK_MODE_MASTER
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_SetWorkMode(SPI_Type *SPIx, uint32_t mode)
  {
    MODIFY_REG(SPIx->CR1, SPI_CR1_MM_Msk, mode);
  }

  /**
   * @brief    Get SPI Working Mode
   * @rmtoll   CR1    MM    FL_SPI_GetWorkMode
   * @param    SPIx SPI instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_SPI_WORK_MODE_SLAVE
   *           @arg @ref FL_SPI_WORK_MODE_MASTER
   */
  __STATIC_INLINE uint32_t FL_SPI_GetWorkMode(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->CR1, SPI_CR1_MM_Msk));
  }

  /**
   * @brief    Set SPI Send Wait Cycle Length in Master Mode
   * @rmtoll   CR1    WAIT    FL_SPI_SetSendWait
   * @param    SPIx SPI instance
   * @param    wait This parameter can be one of the following values:
   *           @arg @ref FL_SPI_SEND_WAIT_0
   *           @arg @ref FL_SPI_SEND_WAIT_1
   *           @arg @ref FL_SPI_SEND_WAIT_2
   *           @arg @ref FL_SPI_SEND_WAIT_3
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_SetSendWait(SPI_Type *SPIx, uint32_t wait)
  {
    MODIFY_REG(SPIx->CR1, SPI_CR1_WAIT_Msk, wait);
  }

  /**
   * @brief    Get SPI Send Wait Cycle Length in Master Mode
   * @rmtoll   CR1    WAIT    FL_SPI_GetSendWait
   * @param    SPIx SPI instance
   * @retval   Returned value can be one of the following values:
   */
  __STATIC_INLINE uint32_t FL_SPI_GetSendWait(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->CR1, SPI_CR1_WAIT_Msk));
  }

  /**
   * @brief    Set SPI Baudrate in Master Mode
   * @rmtoll   CR1    BAUD    FL_SPI_SetClockDivision
   * @param    SPIx SPI instance
   * @param    clock This parameter can be one of the following values:
   *           @arg @ref FL_SPI_CLK_DIV2
   *           @arg @ref FL_SPI_CLK_DIV4
   *           @arg @ref FL_SPI_CLK_DIV8
   *           @arg @ref FL_SPI_CLK_DIV16
   *           @arg @ref FL_SPI_CLK_DIV32
   *           @arg @ref FL_SPI_CLK_DIV64
   *           @arg @ref FL_SPI_CLK_DIV128
   *           @arg @ref FL_SPI_CLK_DIV256
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_SetClockDivision(SPI_Type *SPIx, uint32_t clock)
  {
    MODIFY_REG(SPIx->CR1, SPI_CR1_BAUD_Msk, clock);
  }

  /**
   * @brief    Get SPI Baudrate in Master Mode
   * @rmtoll   CR1    BAUD    FL_SPI_GetClockDivision
   * @param    SPIx SPI instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_SPI_CLK_DIV2
   *           @arg @ref FL_SPI_CLK_DIV4
   *           @arg @ref FL_SPI_CLK_DIV8
   *           @arg @ref FL_SPI_CLK_DIV16
   *           @arg @ref FL_SPI_CLK_DIV32
   *           @arg @ref FL_SPI_CLK_DIV64
   *           @arg @ref FL_SPI_CLK_DIV128
   *           @arg @ref FL_SPI_CLK_DIV256
   */
  __STATIC_INLINE uint32_t FL_SPI_GetClockDivision(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->CR1, SPI_CR1_BAUD_Msk));
  }

  /**
   * @brief    Set SPI Bit Order
   * @rmtoll   CR1    LSBF    FL_SPI_SetBitOrder
   * @param    SPIx SPI instance
   * @param    bitOrder This parameter can be one of the following values:
   *           @arg @ref FL_SPI_BIT_ORDER_MSB_FIRST
   *           @arg @ref FL_SPI_BIT_ORDER_LSB_FIRST
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_SetBitOrder(SPI_Type *SPIx, uint32_t bitOrder)
  {
    MODIFY_REG(SPIx->CR1, SPI_CR1_LSBF_Msk, bitOrder);
  }

  /**
   * @brief    Get SPI Bit Order
   * @rmtoll   CR1    LSBF    FL_SPI_GetBitOrder
   * @param    SPIx SPI instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_SPI_BIT_ORDER_MSB_FIRST
   *           @arg @ref FL_SPI_BIT_ORDER_LSB_FIRST
   */
  __STATIC_INLINE uint32_t FL_SPI_GetBitOrder(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->CR1, SPI_CR1_LSBF_Msk));
  }

  /**
   * @brief    Set SPI Clock Polarity
   * @rmtoll   CR1    CPOL    FL_SPI_SetClockPolarity
   * @param    SPIx SPI instance
   * @param    polarity This parameter can be one of the following values:
   *           @arg @ref FL_SPI_POLARITY_NORMAL
   *           @arg @ref FL_SPI_POLARITY_INVERT
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_SetClockPolarity(SPI_Type *SPIx, uint32_t polarity)
  {
    MODIFY_REG(SPIx->CR1, SPI_CR1_CPOL_Msk, polarity);
  }

  /**
   * @brief    Get SPI Clock Polarity
   * @rmtoll   CR1    CPOL    FL_SPI_GetClockPolarity
   * @param    SPIx SPI instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_SPI_POLARITY_NORMAL
   *           @arg @ref FL_SPI_POLARITY_INVERT
   */
  __STATIC_INLINE uint32_t FL_SPI_GetClockPolarity(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->CR1, SPI_CR1_CPOL_Msk));
  }

  /**
   * @brief    Set SPI Clock Phase
   * @rmtoll   CR1    CPHA    FL_SPI_SetClockPhase
   * @param    SPIx SPI instance
   * @param    phase This parameter can be one of the following values:
   *           @arg @ref FL_SPI_PHASE_EDGE1
   *           @arg @ref FL_SPI_PHASE_EDGE2
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_SetClockPhase(SPI_Type *SPIx, uint32_t phase)
  {
    MODIFY_REG(SPIx->CR1, SPI_CR1_CPHA_Msk, phase);
  }

  /**
   * @brief    Get SPI Clock Phase
   * @rmtoll   CR1    CPHA    FL_SPI_GetClockPhase
   * @param    SPIx SPI instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_SPI_PHASE_EDGE1
   *           @arg @ref FL_SPI_PHASE_EDGE2
   */
  __STATIC_INLINE uint32_t FL_SPI_GetClockPhase(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->CR1, SPI_CR1_CPHA_Msk));
  }

  /**
   * @brief    Enable SPI Dummy Cycle Setting Under 4-lines Half Duplex Mode
   * @rmtoll   CR2    DUMMY_EN    FL_SPI_EnableDummyCycle
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_EnableDummyCycle(SPI_Type *SPIx)
  {
    SET_BIT(SPIx->CR2, SPI_CR2_DUMMY_EN_Msk);
  }

  /**
   * @brief    Disable SPI Dummy Cycle Setting Under 4-lines Half Duplex Mode
   * @rmtoll   CR2    DUMMY_EN    FL_SPI_DisableDummyCycle
   * @param    SPIx SPI instance
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_DisableDummyCycle(SPI_Type *SPIx)
  {
    CLEAR_BIT(SPIx->CR2, SPI_CR2_DUMMY_EN_Msk);
  }

  /**
   * @brief    Get SPI Dummy Cycle Mode Setting
   * @rmtoll   CR2    DUMMY_EN    FL_SPI_IsEnabledDummyCycle
   * @param    SPIx SPI instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_SPI_IsEnabledDummyCycle(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->CR2, SPI_CR2_DUMMY_EN_Msk) == SPI_CR2_DUMMY_EN_Msk);
  }

  /**
   * @brief    Set SPI Data LENGTH 2-4bit
   * @rmtoll   CR2    DLEN2    FL_SPI_SetLengthDataH
   * @param    SPIx SPI instance
   * @param    length This parameter can be one of the following values:
   *           @arg @ref FL_SPI_DATAH_WIDTH0
   *           @arg @ref FL_SPI_DATAH_WIDTH1
   *           @arg @ref FL_SPI_DATAH_WIDTH2
   *           @arg @ref FL_SPI_DATAH_WIDTH3
   *           @arg @ref FL_SPI_DATAH_WIDTH4
   *           @arg @ref FL_SPI_DATAH_WIDTH5
   *           @arg @ref FL_SPI_DATAH_WIDTH6
   *           @arg @ref FL_SPI_DATAH_WIDTH7
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_SetWidthDataH(SPI_Type *SPIx, uint32_t width)
  {
    MODIFY_REG(SPIx->CR2, SPI_CR2_DLEN2_Msk, width);
  }

  /**
   * @brief    Get SPI Data width 2-4bit
   * @rmtoll   CR2    DLEN2    FL_SPI_GetLengtDataH
   * @param    SPIx SPI instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_SPI_DATAH_WIDTH0
   *           @arg @ref FL_SPI_DATAH_WIDTH1
   *           @arg @ref FL_SPI_DATAH_WIDTH2
   *           @arg @ref FL_SPI_DATAH_WIDTH3
   *           @arg @ref FL_SPI_DATAH_WIDTH4
   *           @arg @ref FL_SPI_DATAH_WIDTH5
   *           @arg @ref FL_SPI_DATAH_WIDTH6
   *           @arg @ref FL_SPI_DATAH_WIDTH7
   */
  __STATIC_INLINE uint32_t FL_SPI_GetWidthDataH(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->CR2, SPI_CR2_DLEN2_Msk));
  }

  /**
   * @brief    Set SPI Data width 0-1bit
   * @rmtoll   CR2    DLEN    FL_SPI_SetLengtDataL
   * @param    SPIx SPI instance
   * @param    width This parameter can be one of the following values:
   *           @arg @ref FL_SPI_DATAL_WIDTH0
   *           @arg @ref FL_SPI_DATAL_WIDTH1
   *           @arg @ref FL_SPI_DATAL_WIDTH2
   *           @arg @ref FL_SPI_DATAL_WIDTH3
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_SetWidthDataL(SPI_Type *SPIx, uint32_t width)
  {
    MODIFY_REG(SPIx->CR2, SPI_CR2_DLEN_Msk, width);
  }

  /**
   * @brief    Get SPI Data width 0-1bit
   * @rmtoll   CR2    DLEN    FL_SPI_GetLengtDataL
   * @param    SPIx SPI instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_SPI_DATAL_WIDTH0
   *           @arg @ref FL_SPI_DATAL_WIDTH1
   *           @arg @ref FL_SPI_DATAL_WIDTH2
   *           @arg @ref FL_SPI_DATAL_WIDTH3
   */
  __STATIC_INLINE uint32_t FL_SPI_GetWidthDataL(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->CR2, SPI_CR2_DLEN_Msk));
  }

  /**
   * @brief    Set SPI Data width
   * @rmtoll   CR2    {DLEN2,DLEN}    FL_SPI_GetLengtData
   * @param    SPIx SPI instance
   * @param    cr2_den:
   *           @arg @ref FL_SPI_DATAL_WIDTH0
   *           @arg @ref FL_SPI_DATAL_WIDTH1
   *           @arg @ref FL_SPI_DATAL_WIDTH2
   *           @arg @ref FL_SPI_DATAL_WIDTH3
   * @param    cr2_den2:
   *           @arg @ref FL_SPI_DATAH_WIDTH0
   *           @arg @ref FL_SPI_DATAH_WIDTH1
   *           @arg @ref FL_SPI_DATAH_WIDTH2
   *           @arg @ref FL_SPI_DATAH_WIDTH3
   *           @arg @ref FL_SPI_DATAH_WIDTH4
   *           @arg @ref FL_SPI_DATAH_WIDTH5
   *           @arg @ref FL_SPI_DATAH_WIDTH6
   *           @arg @ref FL_SPI_DATAH_WIDTH7
   * @retval   None
   */
  __STATIC_INLINE void FL_SPI_SetDataWidth(SPI_Type *SPIx, uint32_t cr2_den, uint32_t cr2_den2)
  {
    FL_SPI_SetWidthDataL(SPIx, cr2_den);
    FL_SPI_SetWidthDataH(SPIx, cr2_den2);
  }

  /**
   * @brief    Get SPI Data width
   * @rmtoll   CR2    {DLEN2,DLEN}    FL_SPI_GetLengtData
   * @param    SPIx SPI instance
   * @param    cr2_den:
   *           @arg @ref FL_SPI_DATAL_WIDTH0
   *           @arg @ref FL_SPI_DATAL_WIDTH1
   *           @arg @ref FL_SPI_DATAL_WIDTH2
   *           @arg @ref FL_SPI_DATAL_WIDTH3
   * @param    cr2_den2:
   *           @arg @ref FL_SPI_DATAH_WIDTH0
   *           @arg @ref FL_SPI_DATAH_WIDTH1
   *           @arg @ref FL_SPI_DATAH_WIDTH2
   *           @arg @ref FL_SPI_DATAH_WIDTH3
   *           @arg @ref FL_SPI_DATAH_WIDTH4
   *           @arg @ref FL_SPI_DATAH_WIDTH5
   *           @arg @ref FL_SPI_DATAH_WIDTH6
   *           @arg @ref FL_SPI_DATAH_WIDTH7
   * @retval   None
   */
  __STATIC_INLINE uint32_t FL_SPI_GetDataWidth(SPI_Type *SPIx)
  {
    uint32_t datawith_l = 0;
    uint32_t datawith_h = 0;
    uint32_t datawith = 0;

    datawith_l = (SPIx->CR2 >> 9) & 0x3;
    datawith_h = (SPIx->CR2 >> 12) & 0x7;
    datawith = (datawith_l + 1) * 8 - datawith_h;

