GUdaoxi/demo_qspi/QSPI_QPI/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_spi.h
  /**
   * @brief    Set I2S BaudRate Prescale Fractional
   * @rmtoll   I2SPR    ODD    FL_I2S_SetPrescalerParity
   * @param    I2Sx I2S instance
   * @param    prescalerParity This parameter can be one of the following values:
   *           @arg @ref FL_I2S_PRESCALER_PARITY_EVEN
   *           @arg @ref FL_I2S_PRESCALER_PARITY_ODD
   * @retval   None
   */
  __STATIC_INLINE void FL_I2S_SetPrescalerParity(SPI_Type *SPIx, uint32_t prescalerParity)
  {
    MODIFY_REG(SPIx->I2SPR, I2SPR_ODD_Msk, prescalerParity);
  }

  /**
   * @brief    Get I2S BaudRate Prescale Fractiona
   * @rmtoll   I2SPR    ODD    FL_I2S_GetPrescalerParity
   * @param    I2Sx I2S instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_I2S_PRESCALER_PARITY_EVEN
   *           @arg @ref FL_I2S_PRESCALER_PARITY_ODD
   */
  __STATIC_INLINE uint32_t FL_I2S_GetPrescalerParity(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->I2SPR, I2SPR_ODD_Msk));
  }

  /**
   * @brief    Write I2S BaudRate Prescale
   * @rmtoll   I2SPR    CLKDIV    FL_I2S_WritePrescalerLinear
   * @param    I2Sx I2S instance
   * @param    data
   * @retval   None
   */
  __STATIC_INLINE void FL_I2S_WritePrescalerLinear(SPI_Type *SPIx, uint32_t data)
  {
    MODIFY_REG(SPIx->I2SPR, (0xffU << 0U), (data << 0U));
  }

  /**
   * @brief    Read I2S BaudRate Prescale
   * @rmtoll   I2SPR    CLKDIV    FL_I2S_ReadPrescalerLinear
   * @param    I2Sx I2S instance
   * @retval
   */
  __STATIC_INLINE uint32_t FL_I2S_ReadPrescalerLinear(SPI_Type *SPIx)
  {
    return (uint32_t)(READ_BIT(SPIx->I2SPR, (0xffU << 0U)) >> 0U);
  }

  /**
   * @}
   */

  /** @defgroup SPI_FL_EF_Init Initialization and de-initialization functions
   * @{
   */
  FL_ErrorStatus FL_SPI_DeInit(SPI_Type *SPIx);
  FL_ErrorStatus FL_SPI_Init(SPI_Type *SPIx, FL_SPI_InitTypeDef *initStruct);
  void FL_SPI_StructInit(FL_SPI_InitTypeDef *initStruct);
  FL_ErrorStatus FL_I2S_Init(SPI_Type *SPIx, FL_I2S_InitTypeDef *initStruct);
  void FL_I2S_StructInit(FL_I2S_InitTypeDef *initStruct);

  /**
   * @}
   */

  /**
   * @}
   */

#ifdef __cplusplus
}
#endif

#endif /* __FM33FH0XX_FL_SPI_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2023-03-27*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
